Masmiseim36/nxpSDK/boards/evkcmimxrt1060/el2go_examples/el2go_agent/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD/J13[2] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */
#define BOARD_INITPINS_UART1_TXD_PIN_NAME                          GPIO_AD_B0_12   /*!< Routed pin name */
#define BOARD_INITPINS_UART1_TXD_LABEL                        "UART1_TXD/J13[2]"   /*!< Label */
#define BOARD_INITPINS_UART1_TXD_NAME                                "UART1_TXD"   /*!< Identifier */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD/J11[2] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */
#define BOARD_INITPINS_UART1_RXD_PIN_NAME                          GPIO_AD_B0_13   /*!< Routed pin name */
#define BOARD_INITPINS_UART1_RXD_LABEL                        "UART1_RXD/J11[2]"   /*!< Label */
#define BOARD_INITPINS_UART1_RXD_NAME                                "UART1_RXD"   /*!< Identifier */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_40 (coord A7), ENET_MDC/U18[12] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDC_PERIPHERAL                              ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDC_SIGNAL                              enet_mdc   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_MDC_PIN_NAME                         GPIO_EMC_40   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_MDC_LABEL                     "ENET_MDC/U18[12]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDC_NAME                              "ENET_MDC"   /*!< Identifier */

/* GPIO_EMC_41 (coord C7), ENET_MDIO/U18[11] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_MDIO_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_MDIO_SIGNAL                            enet_mdio   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_MDIO_PIN_NAME                        GPIO_EMC_41   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_MDIO_LABEL                   "ENET_MDIO/U18[11]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_MDIO_NAME                            "ENET_MDIO"   /*!< Identifier */

/* GPIO_B1_10 (coord B13), ENET_TX_REF_CLK/U18[9] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_PERIPHERAL                       ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_SIGNAL                   enet_ref_clk   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_PIN_NAME                   GPIO_B1_10   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_LABEL        "ENET_TX_REF_CLK/U18[9]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TX_REF_CLK_NAME                "ENET_TX_REF_CLK"   /*!< Identifier */

/* GPIO_B1_04 (coord E12), ENET_RXD0/U18[16] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD0_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_RXD0_PIN_NAME                         GPIO_B1_04   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD0_LABEL                   "ENET_RXD0/U18[16]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD0_NAME                            "ENET_RXD0"   /*!< Identifier */

/* GPIO_B1_05 (coord D12), ENET_RXD1/U18[15] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXD1_SIGNAL                         enet_rx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXD1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_RXD1_PIN_NAME                         GPIO_B1_05   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXD1_LABEL                   "ENET_RXD1/U18[15]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXD1_NAME                            "ENET_RXD1"   /*!< Identifier */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV/U18[18] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_CRS_DV_PERIPHERAL                           ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_CRS_DV_SIGNAL                         enet_rx_en   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_CRS_DV_PIN_NAME                       GPIO_B1_06   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_CRS_DV_LABEL               "ENET_CRS_DV/U18[18]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_CRS_DV_NAME                        "ENET_CRS_DV"   /*!< Identifier */

/* GPIO_B1_11 (coord C13), ENET_RXER/U18[20] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_RXER_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_RXER_SIGNAL                           enet_rx_er   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_RXER_PIN_NAME                         GPIO_B1_11   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_RXER_LABEL                   "ENET_RXER/U18[20]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_RXER_NAME                            "ENET_RXER"   /*!< Identifier */

/* GPIO_B1_07 (coord B12), ENET_TXD0/U18[24] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD0_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD0_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD0_CHANNEL                                  0U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_TXD0_PIN_NAME                         GPIO_B1_07   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD0_LABEL                   "ENET_TXD0/U18[24]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD0_NAME                            "ENET_TXD0"   /*!< Identifier */

/* GPIO_B1_08 (coord A12), ENET_TXD1/U18[25] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXD1_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXD1_SIGNAL                         enet_tx_data   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXD1_CHANNEL                                  1U   /*!< Signal channel */
#define BOARD_INITENETPINS_ENET_TXD1_PIN_NAME                         GPIO_B1_08   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXD1_LABEL                   "ENET_TXD1/U18[25]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXD1_NAME                            "ENET_TXD1"   /*!< Identifier */

/* GPIO_B1_09 (coord A13), ENET_TXEN/U18[23] */
/* Routed pin properties */
#define BOARD_INITENETPINS_ENET_TXEN_PERIPHERAL                             ENET   /*!< Peripheral name */
#define BOARD_INITENETPINS_ENET_TXEN_SIGNAL                           enet_tx_en   /*!< Signal name */
#define BOARD_INITENETPINS_ENET_TXEN_PIN_NAME                         GPIO_B1_09   /*!< Routed pin name */
#define BOARD_INITENETPINS_ENET_TXEN_LABEL                   "ENET_TXEN/U18[23]"   /*!< Label */
#define BOARD_INITENETPINS_ENET_TXEN_NAME                            "ENET_TXEN"   /*!< Identifier */

/*!
 * @brief Configures pin routing and optionally pin electrical features for 100M ENET port.
 *
 */
void BOARD_InitEnetPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
